```rootsql
Задача 33.2 'Добро пожаловать в SoloLearn, username':

У нас есть функция, которая выводит "Welcome, user" при обращении. Мы хотим, чтобы она была более персональной.
def welcome_message():
	name = input()
	print("Welcome, user") 
Видоизмените данную функцию таким образом, чтобы она получала имя пользователя в качестве ввода 
и выводила персональное приветственное сообщение.
Пример ввода
Tommy
Пример вывода
Welcome, Tommy

Подсказка:

Не забудьте вызвать функцию.
```
```rootsql
Задача 34.2 'Совпадение паролей':

Вам дана программа с двумя вводами: один представляет собой пароль, а другой — его повторение. 
Выполните и вызовите данную функцию, чтобы вывести "Correct", если пароль и его повтор совпадают, 
и вывести "Wrong", если они не совпадают.
Пример ввода
nfs1598
nfs1598
Пример вывода
Correct

Подсказка:

Не забудьте добавить аргументы, когда будете вызывать функцию.
```
```rootsql
Задача 34.3 'Площадь прямоугольника':

Нам необходимо рассчитать площадь прямоугольника.
Выполните и вызовите функцию, чтобы вывести площадь прямоугольника, используя 2 аргумента — длина и ширина. 
Если стороны равны, функция также должна показывать "Square" во втором выводе.
Пример ввода 1
7
4
Пример вывода 1
28

Подсказка:

Чтобы найти площадь прямоугольника, умножьте его длину на ширину.
```
```rootsql
Задача 35.2 'Генератор хештегов':

Мы создаем приложение для социальной сети, и нам потребуется программа-генератор хэштэгов.
Напишите программу для вывода введенного текста с хэштэгом (#).
Если же пользователь вводит несколько слов, программа должна удалить пробелы между ними.
Пример ввода
code sleep eat repeat
Пример вывода
#codesleepeatrepeat

Подсказка:

Вы можете использовать функцию replace() для замены пробелов (" ") пустыми строками (""). Вот, как это работает:
s = "I like pears"
s1 = s.replace("pears", "apricots")
print(s1)
I like apricots
Обратите внимание, что функция replace() возвращает новую строку. Поэтому вам следует объявить новую переменную для нее.
```