```rootsql
Задача 33.2 'Добро пожаловать в SoloLearn, username':

У нас есть функция, которая выводит "Welcome, user" при обращении. Мы хотим, чтобы она была более персональной.
def welcome_message():
	name = input()
	print("Welcome, user") 
Видоизмените данную функцию таким образом, чтобы она получала имя пользователя в качестве ввода 
и выводила персональное приветственное сообщение.
Пример ввода
Tommy
Пример вывода
Welcome, Tommy

Подсказка:

Не забудьте вызвать функцию.
```
```rootsql
Задача 34.2 'Совпадение паролей':

Вам дана программа с двумя вводами: один представляет собой пароль, а другой — его повторение. 
Выполните и вызовите данную функцию, чтобы вывести "Correct", если пароль и его повтор совпадают, 
и вывести "Wrong", если они не совпадают.
Пример ввода
nfs1598
nfs1598
Пример вывода
Correct

Подсказка:

Не забудьте добавить аргументы, когда будете вызывать функцию.
```
```rootsql
Задача 34.3 'Площадь прямоугольника':

Нам необходимо рассчитать площадь прямоугольника.
Выполните и вызовите функцию, чтобы вывести площадь прямоугольника, используя 2 аргумента — длина и ширина. 
Если стороны равны, функция также должна показывать "Square" во втором выводе.
Пример ввода 1
7
4
Пример вывода 1
28

Подсказка:

Чтобы найти площадь прямоугольника, умножьте его длину на ширину.
```
```rootsql
Задача 35.2 'Генератор хештегов':

Мы создаем приложение для социальной сети, и нам потребуется программа-генератор хэштэгов.
Напишите программу для вывода введенного текста с хэштэгом (#).
Если же пользователь вводит несколько слов, программа должна удалить пробелы между ними.
Пример ввода
code sleep eat repeat
Пример вывода
#codesleepeatrepeat

Подсказка:

Вы можете использовать функцию replace() для замены пробелов (" ") пустыми строками (""). Вот, как это работает:
s = "I like pears"
s1 = s.replace("pears", "apricots")
print(s1)
I like apricots
Обратите внимание, что функция replace() возвращает новую строку. Поэтому вам следует объявить новую переменную для нее.
```
```rootsql
Задача 38.1 'Нет игральной кости? Не проблема!':

Два друга собираются играть в нарды, но они потеряли кубики.
Напишите программу, которая заменит кубики. Когда программа запущена, 
она должна бросить кубики и вывести результат каждого кубика.

Подсказка:

Воспользуйтесь функцией random.randint() для генерации значений в пределах от 1 до 6 для каждого кубика.
В шаблоне кода вы получить строку random.seed(int(input())). Она запускает генератор псевдослучайных чисел и, 
в данном случае, обеспечивает работоспособность пробных случаев.
```
```rootsql
Задача 38.2 'Измерение окружности':

Перед вами программа, которая берет радиус круга в качестве ввода. Дополните код, 
чтобы вывести значения периметра и площади круга.
Пример ввода
5
Пример вывода
Perimeter: 31,42
Area: 78,54

Подсказка:

Функция round() используется для сокращения результата. Она берет число в качестве первого аргумента. 
Второй аргумент представляет собой количество чисел после плавающей запятой.
```
```rootsql
Задача 41 'Конвертер градусов Цельсия в градусы Фаренгейта':

Вы создаете конвертер градусов Цельсия в градусы Фаренгейта. 
Напишите функцию,
которая использует градусы Цельсия в качестве аргумента и выдаст соответствующее значение в градусах Фаренгейта.
Пример вводных данных
36
Пример результата 
96.8

Подсказка:

Для вычисления значения градусов по Фаренгейту используется следующее уравнение: 9/5 * градусы Цельсия + 32.
```