####################################
# 24.1 Списки
words = ["Hello", "world", "!"]
print(words[0])
print(words[1])
print(words[2])
####################################
####################################
# 24.2 Списки
empty_list = []
print(empty_list)
####################################
# 24.3 Списки
number = 3
things = ["string", 0, [1, 2, number], 4.56]
print(things[1])
print(things[2])
print(things[2][2])

m = [
    [1, 2, 3],
    [4, 5, 6]
]
print(m[1][2])
####################################
# 24.4 Списки
str = "Hello world!"
print(str[6])
####################################
