########################
# Решение задачи 65.3 'Лямбда-функции':
x = int(input())
y = (lambda z: z**3)(x)
print(y)
########################
########################
# Решение задачи 66.1 'Сколько им будет лет?':
y = [1995, 2004, 2019, 1988, 1977, 1902]
r = list(map(lambda x: 2050-x, y))
print(r)
########################
########################
# Решение задачи 66.2 'Фильтры':
names = ["David", "John", "Annabelle", "Johnathan", "Veronica"]
res = list(filter(lambda x: len(x) > 5, names))
print(res)
########################
########################
# Решение задачи 67.3 'Генератор-разделитель':

########################
