####################################
# 19.1 Логические выражения
my_boolean = True
print(my_boolean)
print(2 == 3)
print("hello" == "hello")
####################################
####################################
# 19.2 Операции сравнения
print(1 != 1)
print("eleven" != "seven")
print(2 != 10)
####################################
####################################
# 19.3 Операции сравнения
print(7 > 5)
print(10 < 10)
print(11.0 > 11)
####################################
####################################
# 19.4 Операции сравнения
print(7 <= 8)
print(9 >= 9.0)
print("Annie" > "Andy")
####################################
