####################################
# 26.1 Функции списков
nums = [1, 2, 3]
nums.append(4)
print(nums)
####################################
####################################
# 26.2 Функции списков
nums = [1, 3, 5, 2, 4]
print(len(nums))
####################################
# 26.3 Функции списков
words = ["Python", "fun"]
index = 1
words.insert(index, "is")
print(words)
####################################
# 26.4 Функции списков
letters = ['p', 'q', 'r', 's', 'p', 'u']
print(letters.index('r'))
print(letters.index('p'))
print(letters.index('z'))
####################################
