########################
# Решение задачи 9.2 'Найди баг!':
print('I\'m learning Python!')
print("A number enclosed in double quotes: \"42\"")
########################

########################
# Решение задачи 10.2 'Больше строк':
print('A \nB \nC \nD')
print("""A 
B 
C 
D""")
########################

########################
# Решение задачи 11.2 'Строковые операции':
print("ni"*3+"!")
########################

########################
# Решение задачи 13.2 'Развлекаемся с показателями степени':
x = 7
print(x**3)
########################
