####################################
# 29.1 Функция range
numbers = list(range(10))
print(numbers)
####################################
####################################
# 29.2 Функция range
numbers = list(range(3, 8))
print(numbers)
print(range(20) == range(0, 20))
####################################
# 29.3 Функция range
numbers = list(range(5, 20, 2))
print(numbers)
####################################
####################################
# 29.4 Циклы for
for i in range(5):
    print("hello!")
####################################
